app/controllers/home_controller.rb

	def login
		allUsers = User.pluck(:username)
---
SELECT "users"."username" FROM "users"

	def post_login
		username = params[:username]

		# check if username exists.
		allUsers = User.pluck(:username)
		if ! allUsers.include? username then
			if ! @@originalUsers.include? username then
				redirect_to :controller => "home", :action => "create"
				return
			end
		end

		session[:username] = username
		user = User.find_by_username(username)

		if (user.password != params[:password]) && (! @@originalUsers.include? username) then
			flash[:incorrect] = "Username or password incorrect!"
			redirect_to :action => "login"
			return
		end

		if user.nil? then
			u = User.new
			u.username = username
			u.save()
---
SELECT "users"."username" FROM "users"
SELECT "users".* FROM "users" WHERE "users"."username" = 'joelee' LIMIT 1
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 23 May 2014 11:22:25 UTC +00:00], ["updated_at", Fri, 23 May 2014 11:22:25 UTC +00:00], ["username", "lgkjeofjaldf"]]

	def post_create
		username = params[:username]
		allUsers = User.pluck(:username)
		if allUsers.include? username then
			flash[:taken] = "Username already taken :("
			redirect_to :action => "create"
			return
		end

		u = User.new
		u.username = username
		u.password = params[:password]
		u.save()
---
SELECT "users"."username" FROM "users"
INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 24 May 2014 06:55:48 UTC +00:00], ["password", "qwerty"], ["updated_at", Sat, 24 May 2014 06:55:48 UTC +00:00], ["username", "qwerty"]]