app/controllers/schedule_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'joelee' LIMIT 1
SELECT "facts".* FROM "facts"
---
	def index
		user = User.find_by_username(session[:username])
		@username = session[:username]
		@sleep_debt = user.schedule.current_debt
		@required_num_hours = user.schedule.required_num_hours

		if (@sleep_debt > 0) then
			facts = Fact.find(:all)
			numFacts = facts.size()-1

SELECT "users".* FROM "users" WHERE "users"."username" = 'joelee' LIMIT 1
INSERT INTO "schedules" ("created_at", "current_debt", "started_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 23 May 2014 13:00:38 UTC +00:00], ["current_debt", 0], ["started_at", Fri, 23 May 2014 13:00:38 UTC +00:00], ["updated_at", Fri, 23 May 2014 13:00:38 UTC +00:00]]
UPDATE "schedules" SET "user_id" = $1, "updated_at" = $2 WHERE "schedules"."id" = 2  [["user_id", 1], ["updated_at", Fri, 23 May 2014 07:22:16 UTC +00:00]]
---
	def post_create_schedule
		username = session[:username]
		user = User.find_by_username(username)
		sched = Schedule.new
		sched.started_at = DateTime.now
		sched.current_debt = 0
		sched.required_num_hours = params[:required_num_hours]
		sched.save
		user.schedule = sched
		user.save

SELECT "users".* FROM "users" WHERE "users"."username" = 'joelee' LIMIT 1
INSERT INTO "days" ("created_at", "hours_slept", "recorded_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 23 May 2014 08:55:28 UTC +00:00], ["hours_slept", 6], ["recorded_at", Fri, 23 May 2014 08:55:28 UTC +00:00], ["updated_at", Fri, 23 May 2014 08:55:28 UTC +00:00]]
UPDATE "days" SET "schedule_id" = $1, "updated_at" = $2 WHERE "days"."id" = 1  [["schedule_id", 2], ["updated_at", Fri, 23 May 2014 08:55:28 UTC +00:00]]
UPDATE "schedules" SET "current_debt" = $1, "updated_at" = $2 WHERE "schedules"."id" = 6  [["current_debt", 2], ["updated_at", Fri, 23 May 2014 07:35:27 UTC +00:00]]
---
	def log_hours
		user = User.find_by_username(session[:username])

		hoursSlept = params[:hours]

		sleepDebt = user.schedule.required_num_hours.to_i - hoursSlept.to_i

		schedule = user.schedule
		schedule.current_debt = user.schedule.current_debt.to_i + sleepDebt

		if schedule.current_debt < 0 then
			schedule.current_debt = 0
		end

		day = Day.new
		day.recorded_at = DateTime.now
		day.hours_slept = hoursSlept
		day.save()

		schedule.days << day
		schedule.save